<?php

namespace App\Http\Controllers;

use Illuminate\Http\Request;

class QueryRuleController extends Controller
{
    public function getData()
    {
        $arr = [
            'Code' => 1,
            'ErrorMsg' => '',
            'Rule' => [
                [
                    'Content' => '投資決策者需要建立在獨立思考之上，祝您操作順利。<br>' ,
                    'Title' => '系統公告'
                ],
                [
                    'content' => '1)開盤前不接受任何預約單。<br>↵2)開盤風控點位預設值,留倉單於每日開盤時若每手(口)單位漲跌幅正負值超過「商品資訊」內「開盤風控點數」，系統將自動平倉，午盤休息視為收盤。<br>↵3)開盤風控是以，可交易時間的第一筆報價和昨日最後一筆報價去計算。<br>' ,
                    'Title' => '開盤'
                ],
                [
                    'content' => '1)市價單:下單後以下一筆報價為成交點位。<br>↵2)可設限價單以及持倉後可設「停損」「停利」單，掛價單只限於當日有效，收盤後自動取消需重新設置。<br>↵<b style="color:#f00;">3)未成交之掛單，若於成交時帳戶餘額不足手續費時，系統自動刪除掛單，視同刪除單，成交不算。</b><br>↵4)當日行情漲跌幅到達該商品禁新價時，該商品系統將不收新單。<br>↵5)當日行情漲跌幅到達該商品強平價時，所有在倉單之多單、空單，系統將所有在倉單強制以下一筆報價平倉。<br>' ,
                    'Title' => '盤中'
                ],
                [
                    'content' => '<b style="color:#f00;">1)商品收盤後(含上午盤)，系統將取消該商品未成交掛價單及停損停利。<br>↵2)商品收盤，系統檢查該留倉單是否超過「留倉上限」及「帳戶餘額」是否足夠「留倉保證金」進行留倉指令，若有不足則強制平倉。<br>↵3)留倉規則採商品先收盤先留倉原則。<br></b>' ,
                    'Title' => '收盤'
                ],
                [
                    'content' => '1)商品最後交易日當天將全部強制平倉不可留倉。<br>↵2)換倉日:以系統時間為準。<br>' ,
                    'Title' => '最後交易日及換倉'
                ],
                [
                    'content' => '帳戶餘額:當「≦強制平倉額度」時，所有持倉部份自動以市價強制平倉。<br>' ,
                    'Title' => '持倉規定'
                ],
                [
                    'content' => '下單交易方式分為買(多)或買(空)，如下單買升點數向上漲表示獲利往下跌則為虧損，如下單買跌點數向下跌表示獲利點數向上漲表示虧損。<br>↵例1. 買多一手黃金16888在16988時賣出則損益則為＞＞16988-16888=10大點*500(每一整數點價值)-手續費300 所以損益=4700<br>↵<br>↵例2. 買多一手黃金16988在16888時賣出則損益則為＞＞16888-16988=-10大點*500(每一整數點價值)-手續費300 所以損益=-5300<br>' ,
                    'Title' => '計算方式'
                ],
                [
                    'content' => '1)結算時間，將所有在倉單商品以結算時間的前一筆點位結算，積分轉入昨日積分餘額，以統計損益。<br>↵2)結算時間暫時停止新下單，將所有在倉單與留倉單以收盤最後1筆(有量)之成交點位轉入新單。<br>↵3)每日結算完後，系統將會把今日損益提列到帳戶餘額做相加減，查帳請至統計或帳戶歷史觀看。<br>↵4)會員結算時間請至會員資訊查詢。↵' ,
                    'Title' => '統計結算方式'
                ],
                [
                    'content' => '1)美盤商品每日有部份時段成交量極低，稱為低量時段(請參考交易時間表)，此時段本系統不接受新單(禁新)，但若有在倉單可平(關倉)不受此限。<br>' ,
                    'Title' => '低量時段'
                ],
                [
                    'content' => '1)因每家報價資料皆有些許誤差，如遇會員本身斷線、當機、塞車、電腦老舊....等硬體或傳輸問題，則所有成交價格均以「本系統網路資料(分價揭示)」為主，若系統發生延遲緩慢或不能下單，未平倉單損益不予計算。<br>↵2)全商品暫停交易,待系統恢復方可繼續交易<br>↵3)系統斷線期間斷線商品在倉部位欲平倉請與上層代理聯繫,如無來電平倉則繼續持有,待系統恢復再自行平倉<br>' ,
                    'Title' => '聲明'
                ],

            ],
        ];

        return response()->json($arr);
    }
}
